app/views/teamlead/add_task.html.erb


			<%= t.collection_select :tasktype_id, Tasktype.all, :id, :ttype, class: 'form-control'  %><br>
---
SELECT "tasktypes".* FROM "tasktypes"

			<%= t.label :Assign_Employee %>
			<%= t.grouped_collection_select :user_id, Usertype.order(:utype), :users, :utype,:id, :username,:include_blank => false, class: 'form-control'  %><br>
---
SELECT "users".* FROM "users" WHERE "users"."utype_id" = ?  [["utype_id", 3]]
SELECT "usertypes".* FROM "usertypes" WHERE "usertypes"."utype" = ?  [["utype", "3"]]