app/views/teamlead/make_task_tl.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
				    	<% if t.user_id and (t.user_id != t.teamlead_id) %>
				    		<td><%= User.find(t.user_id).username%></td>

SELECT  "usertypes".* FROM "usertypes" WHERE "usertypes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
				    	<td>
				    		<% if t.user_id and User.find(t.user_id).usertype_id == 3  %>