app/views/task/show.html.erb

				Assigne Type -
				<% if @tk.user_id and User.find(@tk.user_id).usertype_id == 3  %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

			<div class="well">
				<%@dps = User.where("teamlead_id = ? and usertype_id = 3", Teamlead.find_by_username(current_user.username).id)%>
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]