app/views/admin/assign_employee.html.erb

					    	<td><%= e.username%></td>
					    	<td><%= Usertype.find(e.usertype_id).utype %></td>
---
SELECT  "usertypes".* FROM "usertypes" WHERE "usertypes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]