app/views/admin/edit_project_multiple.html.erb

SELECT "teamleads".* FROM "teamleads" WHERE (id != 1)
---
				<%= r.label :Teamlead %><br>
				<% @tl   = Teamlead.where("id != ?",1)  %>