app/views/admin/tester.html.erb

SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
							<td><%= u.username %> </td>
							<td>Assigned to <%=Teamlead.find(u.teamlead_id).username %></td>