app/views/requirement/edit.html.erb

SELECT "teamleads".* FROM "teamleads" WHERE (id != 1)
---
		<%= r.input :teamlead_id do%><br>
			<% @tl   = Teamlead.where("id != ?",1)  %>