app/views/requirement/new.html.erb

		<%= r.input :teamlead_id do%><br>
			<% @tl   = Teamlead.where("id != ?",1)  %>
---
SELECT "teamleads".* FROM "teamleads" WHERE (id != 1)