app/views/requirement/show.html.erb

			<% if @rq.teamlead_id != nil %>
				<%= Teamlead.find(@rq.teamlead_id).username%>
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]