app/views/home/index.html.erb

					<% if t.teamlead_id != nil %>
						<td><%= Teamlead.find(t.teamlead_id).username%></td>
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]