app/controllers/admin_controller.rb

SELECT "teamleads".* FROM "teamleads" ORDER BY created_at DESC
---
	def teamlead
		@tls= Teamlead.all.order("created_at DESC")

SELECT "users".* FROM "users" WHERE "users"."usertype_id" = ?  [["usertype_id", 3]]
---
	def developer
		@ds= User.where(:usertype_id => 3)

SELECT "users".* FROM "users" WHERE "users"."usertype_id" = ?  [["usertype_id", 4]]
---
	def tester
		@ts= User.where(:usertype_id => 4)

SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" IN (9, 8)
---
  def edit_project_multiple
  	if params[:project_ids] == nil
  		flash[:notice] =  "You Didn't selected any project"

  		redirect_to root_path
  	else
    	@rqs = Requirement.find(params[:project_ids])

UPDATE "requirements" SET "avatar" = ?, "description" = ?, "updated_at" = ? WHERE "requirements"."id" = ?  [["avatar", "\"winmail.dat\""], ["description", "all about 5th project."], ["updated_at", "2018-03-08 07:13:51.702204"], ["id", 9]]
---
  def update_project_multiple
    @rqs = Requirement.update(params[:projects].keys, params[:projects].values)

SELECT "users".* FROM "users" ORDER BY usertype_id
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def assign_employee
  	@employees= User.order("usertype_id")
	@tl= Teamlead.find(params[:id])

UPDATE "users" SET "teamlead_id" = 2 WHERE "users"."id" IN (6, 8)
---
  def assign_employee_put
  	@uassign = User.where(id: params[:employee_ids]).update_all teamlead_id: params[:tid]