app/controllers/developer_controller.rb

	def done_multiple_update
		authorize! :update , Task
	 	@tasks= Task.where(id: params[:tasks_ids])
		@tasks.each do |t|
			if t.status_id == 1
				if t.tester_id != t.teamlead_id
					t.status_id = 3
				else
					t.status_id = 2
				end
				#*****Motifications
				@tl=User.find_by_username(Teamlead.find(t.teamlead_id).username)
				# For teamlead
				str="Task name: '#{t.name}' of Project: '#{Requirement.find(t.requirement_id).name}' has been done by Developer: #{current_user.username}"
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IS NULL
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]