app/controllers/employee_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def find_employee
  		@employee = User.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]
---
	def destroy

		@task=Task.find_by_user_id(@employee.id)
		if @task != nil
			@task.update_attribute(:user_id, @task.teamlead_id)
		end
  		@employee.destroy