app/controllers/home_controller.rb

  def index
  	@tasks= Task.all.order("created_at DESC")
  	@rqs= Requirement.all.order("created_at DESC")
  	@tks= Task.where(:user_id => current_user )
---
SELECT "requirements".* FROM "requirements" ORDER BY created_at DESC
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 5