app/controllers/requirement_controller.rb

	def create
    	@rq = current_user.requirements.build(requirement_params)
    	if @rq.save
---
INSERT INTO "requirements" ("end", "created_at", "updated_at", "name", "description", "avatar", "teamlead_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def showa
    @dps = User.where("teamlead_id = ? and usertype_id = 3", @rq.teamlead_id)
    @tts = User.where("teamlead_id = ? and usertype_id = 4", @rq.teamlead_id)
    @tks= Task.where(:requirement_id => params[:id])
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."requirement_id" = ?  [["requirement_id", 3]]

  def show
    @dps = User.where("teamlead_id = ? and usertype_id = 3", Teamlead.find_by_username(current_user.username).id)
    @tts = User.where("teamlead_id = ? and usertype_id = 4", Teamlead.find_by_username(current_user.username).id)
    @adps = User.where("teamlead_id = ? and usertype_id = 3", @rq.teamlead_id)
    @atts = User.where("teamlead_id = ? and usertype_id = 4", @rq.teamlead_id)
    @tks= Task.where(:requirement_id => params[:id])
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."requirement_id" = ?  [["requirement_id", 1]]

  def update
  	if @rq.update_attributes(requirement_params)
---
UPDATE "requirements" SET "description" = ?, "updated_at" = ? WHERE "requirements"."id" = ?  [["description", "all about 5th project"], ["updated_at", "2018-03-08 07:14:06.033336"], ["id", 9]]

  def find_requirement
  	@rq = Requirement.find(params[:id])
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]