app/controllers/task_controller.rb

SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "start", "end", "created_at", "updated_at", "user_id", "teamlead_id", "tasktype_id", "requirement_id", "status_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def create
    	@tk = Task.new(task_params)
      @rq= Requirement.find(@tk.requirement_id)
      if @tk.developer_id != nil
        @tk.status_id = 1
        if @rq.users.where(:id => @tk.developer_id).empty?
          @rq.users << User.find(@tk.developer_id)
        end
      else
        @tk.developer_id = @tk.teamlead_id
    	end

      if @tk.tester_id == nil
         @tk.tester_id = @tk.teamlead_id
      else
        if @rq.users.where(:id => @tk.tester_id).empty?

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
  	@tk.destroy

    #==notifications
    @tl=User.find_by_username(current_user.username).id
    #For Admin
    str="Task no #{@tk.id}  of Project #{Requirement.find(@tk.requirement_id).name} has been deleted by you."

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "status_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status_id", 5], ["updated_at", "2018-03-08 09:43:32.971540"], ["id", 12]]
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def close_task

    @tks=Task.where(id: params[:id]).update status_id: 5
    @tks.each do |t|

      #==notifications
      @tl=User.find_by_username(current_user.username)
      #For teamlead
      str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been closed by you."
      @n=Notification.create(:notice => str, :user_id => @tl.id)
      @n.save!
      #For admin
      str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been closed by Team Lead: #{current_user.username}."
      @n=Notification.create(:notice => str, :user_id => User.find(@tl.teamlead_id).id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "tasks" SET "status_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status_id", 6], ["updated_at", "2018-03-08 10:22:12.967141"], ["id", 16]]
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def reopen_task
    authorize! :update , Task
    if @tk.status_id == 5

      #==notifications
      Task.where(id: params[:id]).update status_id: 6
      @tl=User.find_by_username(Teamlead.find(@tk.teamlead_id).username).id
      #For teamlead
      str="Task no #{@tk.id}  of Project #{Requirement.find(@tk.requirement_id).name} has been reopened by Admin: #{current_user.username}."

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_task
  	@tk = Task.find(params[:id])