app/controllers/teamlead_controller.rb

SELECT "tasktypes".* FROM "tasktypes"
---
	def add_task
		authorize! :create, Task
		@tasktype= Tasktype.all