app/controllers/teamlead_controller.rb

	def make_task_tl
		authorize! :read, User
		@rq = Requirement.find(params[:id])
		@tks= Task.where(:requirement_id => params[:id])
		@dps = User.where("teamlead_id = ? and usertype_id = 3", Teamlead.find_by_username(current_user.username).id)
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."requirement_id" = ?  [["requirement_id", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def tl_assign_to_multiple
		@rq = Requirement.find(params[:id])
		if(params[:developer] != "" and params[:tester] != "")

			flash[:notice] =  "You cannot select both developer and tester "
			redirect_to make_task_tl_path(@rq.id)

		else
			if (params[:developer] != "" && params[:tasks_ids] != nil)

				Task.where(id: params[:tasks_ids]).update_all user_id:   params[:developer]
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "user_id" = 5 WHERE "tasks"."id" IN (3, 4)

	def tl_assign
		@rq = Requirement.find(params[:rid])
		if(params[:developer] != nil and params[:tester] != nil)

			flash[:notice] =  "You cannot select both developer and tester "
			redirect_to make_task_tl_path(@rq.id)

		else
			if (params[:developer] != nil )

				Task.where(id: params[:tid]).update_all user_id:   params[:developer]
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "status_id" = 3 WHERE "tasks"."id" = ?  [["id", 11]]

	def add_task
		authorize! :create, Task
		@rq  = Requirement.find(params[:id])
		@emp = User.where("teamlead_id = ?", current_user.id)
		@dps = User.where("teamlead_id = ? and usertype_id = 3", Teamlead.find_by_username(current_user.username).id)
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (teamlead_id = 2 and usertype_id = 3) ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."usertype_id" = ?  [["usertype_id", 1]]

	def developer
		@dps = User.where("teamlead_id = ? and usertype_id = 3", Teamlead.find_by_username(current_user.username).id)
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def tester
		@tts = User.where("teamlead_id = ? and usertype_id = 4", Teamlead.find_by_username(current_user.username).id)
---
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."username" = ? LIMIT ?  [["username", "tl1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]