app/controllers/tester_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IS NULL
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "teamleads".* FROM "teamleads" WHERE "teamleads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "status_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status_id", 4], ["updated_at", "2018-03-06 12:17:37.639730"], ["id", 11]]
---
	def done_multiple_update
		authorize! :update , Task
	 	@tasks= Task.where(id: params[:tasks_ids])
		@tasks.each do |t|
			if t.status_id == 3
				t.status_id = 4
				@tl=User.find_by_username(Teamlead.find(t.teamlead_id).username).id
				str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been reviewed by Tester: #{current_user.username}"
				@n=Notification.create(:notice => str, :user_id => @tl)
				@n.save!

				str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been reviewed by you"
				@n=Notification.create(:notice => str, :user_id => current_user.id)
				@n.save!
				flash[:notice] = str

			elsif t.status_id == 4
				t.status_id = 3
				@tl=User.find_by_username(Teamlead.find(t.teamlead_id).username).id
				str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been reverted by Tester: #{current_user.username}"
				@n=Notification.create(:notice => str, :user_id => @tl)
				@n.save!

				str="Task no #{t.id}  of Project #{Requirement.find(t.requirement_id).name} has been reverted by you"
				@n=Notification.create(:notice => str, :user_id => current_user.id)
				@n.save!
				flash[:notice] = str

			end
			t.save