app/views/users/registrations/edit.html.erb

SELECT  "usertypes".* FROM "usertypes" WHERE "usertypes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <%= f.label :Select_type_of_user %><br />
        <% @ut   = Usertype.where("id != ? and id!= ?",1,2)  %>